# Подведем итоги:
#
# Создайте файл github/opensource.ipynb и ответьте на список вопросов:
# Проект в который вы отправили пул реквест, попадает под определение опенсорса:
#
# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# Да, в корне репозитория есть файл LICENSE → BSD-3-Clause.
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# pandas
# https://github.com/pandas-dev/pandas
#
# Проект активно принимает стороннюю помощь?
# Да, у проекта открыто множество issues и pull requests, активно ведётся обсуждение. Есть даже раздел good first issue для новичков.
#
# Напишите второе улучшение которое вы сделали
# В README убрала отступы и линовку по центру
#
# Посмотрите на коммиты в основной ветке, напишите общее количество
# 33,900
#
# Когда был последний коммит?
# 2 дня назад
#
# Сколько контрибьюторов у проекта?
# 3505
#
# Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# Каждый день
#
# Сколько сейчас открытых ишью?
# 3515
#
# Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# Да, часто в течение 1–3 дней есть первый ответ.
#
# Ведётся ли активное обсуждение ишью?
# да
#
# Есть ли недавно созданные ишью?
# да, 2 дня назад
#
# Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# да 24 216
#
# Сколько сейчас открытых пул-реквестов?
# 152
#
# Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Да, первые ревью часто в течение нескольких дней.
#
# Ведётся ли активное обсуждение пул-реквестов?
# да
#
# Есть ли недавно отправленные пул-реквесты?
# 3 часа назад
#
# Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# 2 часа назад
#
#
#
